{
	"lastUpdateDate": "2023-02-14",
	"heroes": [
		{
			"id": "TB_BaconShop_HERO_16",
			"name": "A. F. Kay",
			"tips": [
				{
					"summary": "In the first 2 turns, instead of going AFK, try to freeze a value generating card that you then use on your discovery turn to level to tavern 2.I usually follow up by going Tavern 3 on 6 gold and then playing normally but it depends on what shop you get on tavern 2.If you don't get a value start, I'd still recommend leveling to 2 on 5 gold in most cases.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Do not rely on the buddy for any amount of relevant scaling",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_21",
			"name": "The Great Akazamzarak",
			"tips": [
				{
					"summary": "Play normally and use the hero power to give you tempo early game and usually a poison 2/3 late-game, it can be game-changing in the right lobby!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Do not rely on the buddy for anything",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_76",
			"name": "Al-Akir",
			"tips": [
				{
					"summary": "Level a bit more aggressively than on a normal hero and make use of your hero power early/mid-game. Towards late-game, assume people will position around your divine shielded taunt so get some extra taunts while you also play around a potential cleave if that’s available in the lobby.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Tarecgosa and Persistent Poet can keep the heropower & buddy effect permanently",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_56",
			"name": "Alexstrasza",
			"tips": [
				{
					"summary": "Try to map your leveling path up to 5 and go there as soon as possible without taking way too much damage. Sometimes even the basic curve followed by skipping taverns 3 and 4 could be a good way to play this hero! (7gold=tavern 3, 8gold=tavern 4, 9gold=sell a minion and go tavern5 and get your hero power activated)",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Don't care about winning early fights; rush to tier 4 and be willing to spend a lot of gold for the buddy",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG22_HERO_201",
			"name": "Ambassador Faelin",
			"tips": [
				{
					"summary": "Try to pick minions that are good on their own, not around a combo(at least for 2 and 4 stars). If you don't hit a 6 drop that creates your gameplan, pick something that adds utility or has a lot of stats on it’s own and play normally after you go to tavern 4, you don't always need to rush to 6. This hero is very good with murlocs because it works with the hand buffing effects!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Brann / Rylak / Mooneater's Champion / Young Murkeye are key synergies to make your buddy worthwhile",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_59",
			"name": "Aranna Starseeker",
			"tips": [
				{
					"summary": "Play normally in the beginning and be a bit greedier once you get your hero power going. Prioritize minions that are sticky such as deathrattles and reborns to complete your hero power faster.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Your buddy works with spells too; its best use case is low tier cycling comps like living azerite",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_72",
			"name": "Lord Barov",
			"tips": [
				{
					"summary": "Just win the bets, LOL.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Additional early money is best spent leveling faster than everyone else",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_70",
			"name": "Mr. Bigglesworth",
			"tips": [
				{
					"summary": "Ideally play defensive until one player dies. That is not always possible so sometimes it's okay to play like a normal hero but know this: Before a player dies, you are the worst hero in the game. The more players die the stronger you become so play accordingly!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "The buddy is fine but the heropower is terrible",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG20_HERO_103",
			"name": "Death Speaker Blackthorn",
			"tips": [
				{
					"summary": "While I don’t think you want to force quillboar, you should pick up the buffs for blood gems since it’s so easy for you to generate them. I like buying a minion that can potentially be buffed early and focus all gems on it. Don’t keep gems in your hand waiting for the best minion to come because you can always move gems if needed!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Don't overvalue your heropower before you get gem buffs",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_43",
			"name": "Dinotamer Brann",
			"tips": [
				{
					"summary": "If there are enough battlecries on tavern 1, I like staying there until I get the Brann and then level while dealing a lot of damage to opponents. If you aren’t offered battlecries however, don’t force your hand. Level and play normally and get the Brann a bit later, it’s still going to be good!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Look at the minion types before the game to determine if you want to get brann ASAP or buy stronger minions",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG22_HERO_001",
			"name": "Bru'kan",
			"tips": [
				{
					"summary": "This hero plays best with avenge minions that you can ''milk'' utilising earth invocation. Late-game you almost always want to use Lightning Invocation to break opponent's divine shields and give yourself an edge in the fights.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Avoid taunt heropower with buddy, and don't use deathrattle heropower if you want to macaw your buddy",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG26_HERO_101",
			"name": "Cap'n Hoggarr",
			"tips": [
				{
					"summary": "Start the game with the intention of playing pirates but don’t force them if you get very little to none.I like leveling on 2 because Ripsnarl is so powerful, would only stay a bit more on tavern 1 if I have an abundance of pirates that I can buy on turns 1,2 and 3 and then would still level as fast as possible. Later on in the game, Underhanded Dealer is the best minion to find since every pirate you buy afterwards is an extra +1/+1 on it!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Don't (anymore, the buddy got nerfed into the ground)",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG21_HERO_000",
			"name": "Cariel Roame",
			"tips": [
				{
					"summary": "I like staying one more turn on 1 only with a great duplicate such as Mummy. Otherwise level normally to 2 and maybe consider going tavern 3 on 6 gold since that allows you to fit the hero power. Play normally most of the game but try to fit the hero power when you think you have a board mostly of minions that you intend on keeping, it adds a lot of stats!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Don't",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_78",
			"name": "Chenvaala",
			"tips": [
				{
					"summary": "Even if you don't have to end up as elementals every game, when you pick this hero you should know most games will end up like that. Ideally you buy a lot of cheap elementals and don't even pay for leveling, advancing through the taverns while building a powerful board.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Don't buy bad elementals, you'll get offered plenty with your buddy",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BGDUO_HERO_222",
			"name": "Cho",
			"tips": [
				{
					"summary": "I think the best way to play this hero combination is one player leveling more aggressively and being served powerful discoveries and one player playing more tempo oriented and trying to win fights or minimize damage taken. Once you are done getting value from the hero power, it’s best if the player that is ahead helps the other one build a powerful board as well.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				}
			]
		},
		{
			"id": "BGDUO_HERO_223",
			"name": "Gall",
			"tips": [
				{
					"summary": "I think the best way to play this hero combination is one player leveling more aggressively and being served powerful discoveries and one player playing more tempo oriented and trying to win fights or minimize damage taken. Once you are done getting value from the hero power, it’s best if the player that is ahead helps the other one build a powerful board as well.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				}
			]
		},
		{
			"id": "BG21_HERO_020",
			"name": "Cookie the Cook",
			"tips": [
				{
					"summary": "With a value generator start or in a meta where 3 on 3 is the preferred way of playing, Cookie is one of the best heroes in the game at snowballing. If you have that start, try to level quickly and get good minions to help you snowball. Go for stats over synergies early and only build on a win-condition once you get a minion that can support it! If you don't have a value start, Cookie can still offer you some gold or powerful minions to smoothen your curve.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Don't keep the buddy forever",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_29",
			"name": "C'Thun",
			"tips": [
				{
					"summary": "Play normally until you get a good board, then hero power every turn. You can still hero power if it's the best play that turn(example:5gold and you don't have a value start that allows you to double buy) but don't go out of your way to press it every turn. You should press it every turn if you build around Dragons with Whelp Smuggler however since you'd like to maximize health in that case.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Don't",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_33",
			"name": "The Curator",
			"tips": [
				{
					"summary": "Try to reborn the amalgam for a power boost, keep in mind that it will work in most builds until late game and the best part about it is that it can take the buffs that other minions don’t need or can’t receive.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "The buddy scaling is never gamewinning on its own; you still need to find a real comp",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_52",
			"name": "Deathwing",
			"tips": [
				{
					"summary": "Plays best with divine shields and cleaves.Other than that, prioritize health since you get attack from your hero power anyways",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Deflect-o-Bot",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG20_HERO_666",
			"name": "Diablo",
			"tips": [
				{
					"summary": "I like following the basic curve because being too strong on turn 4 leads to 10 prizes where being average you’re still going to win most fights because of the extra minion and still get like 8 prizes. Turn 8 is most important in the game for you so make sure that you not only have a good direction, but also a lot of power for that turn.I’d keep most prizes from turn 4 for turn 8 but use the ones you get on 8 if needed to kill the rest of the players.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_36",
			"name": "Dancin' Deryl",
			"tips": [
				{
					"summary": "I recommend playing normally and just using the hats to improve your early game. It’s not worth for a few buffs to sell your board just in order to buff a minion.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Neither your heropower nor your buddy are direction",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG28_HERO_801",
			"name": "Doctor Holli'dae",
			"tips": [
				{
					"summary": "Try to fit your hero power as many times as you can but don’t do stuff like selling a token on 1 to hero power. This hero can play any curve and one of it’s main strengths is how versatile it is but it preffers a gameplan that buys a lot of minions early and makes a big board fast.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				}
			]
		},
		{
			"id": "BG22_HERO_002",
			"name": "Drek'Thar",
			"tips": [
				{
					"summary": "I like going for divine shield builds on this hero to capitalize on the bonus attack. Minions that summon are also really good to stack up the damage",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Needs mechs",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_01",
			"name": "Edwin VanCleef",
			"tips": [
				{
					"summary": "Play normally in the beginning and go for buffs mid/late game or when you have one gold left over. Best to buff divine shields/cleaves!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Don't",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_42",
			"name": "Elise Starseeker",
			"tips": [
				{
					"summary": "I like hero powering until it costs 5, that's too much most of the time. I generally use the first hero power for tempo and then, if the game goes badly I use them for more tempo, otherwise I try to discover 5 or 6 drops and snowball the game from there!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Use your heropower early to keep up tempo and win fights, don't get greedy with it",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BGDUO_HERO_101",
			"name": "Flobbidinous Floop",
			"tips": [
				{
					"summary": "The ideal strategy here is to help your teammate get a strong high tavern minion on their board so that you can also copy it. Early game your hero power is a great tempo tool that allows you to level aggressively.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				}
			]
		},
		{
			"id": "BG24_HERO_204",
			"name": "Enhance-o Mechano",
			"tips": [
				{
					"summary": "Play normally and sometimes you get good minions offered, it's a pretty versatile hero that doesn't really change your playstyle.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Tier 1 buddy is a guaranteed triple, free stats are nice",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG25_HERO_105",
			"name": "E.T.C., Band Manager",
			"tips": [
				{
					"summary": "I like following the basic curve and hero powering as much as possible. The difference between basic curve and going 3 on 3 is minimal, you get one extra 3 drop instead of two 2 drops, which sometimes can even be worse than the two drops!",
					"author": "rdu",
					"language": "enUS",
					"patch": 176014,
					"date": "2023-05-28"
				},
				{
					"summary": "Take Thorim's buddy turns 3-5 if possible, followed by buddy button to golden it turn 6 (evolving your buddy)",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_64",
			"name": "Captain Eudora",
			"tips": [
				{
					"summary": "I like starting to hero power on turn 2, build a strong board and finish my first dig on tavern 4 discovering a 5. Afterwards, I go for a second dig only if I have the money to press the hero power but I don't go out of my way to press it. Some players don't even bother with a second dig and just use the boost from the first one and then ignore the hero power completely.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Heropower asap, or your buddy will be useless",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_40",
			"name": "Sir Finley Mrrgglton",
			"tips": [
				{
					"summary": "Pick this hero if you have no tier 1 options. A great advantage is that you can see the starting shop before you make your pick but don't make your pick ONLY around the starting shop.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Try to get a heropower whose buddy is tier 4 or higher",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_55",
			"name": "Fungalmancer Flurgl",
			"tips": [
				{
					"summary": "Don't level too quickly! Focus on building the board and stay a bit more on taverns 2/3 if the game is going badly. Also, since you're probably building murlocs try to not buy too many of the other minions since you'll have to sell them later(if you have the option to).",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "It's brann or nothing, ideally use the buddy on tier 5s",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_02",
			"name": "Galakrond",
			"tips": [
				{
					"summary": "Only hero power turn 1 if you have token start, otherwise it's fine to start on 2. Don't be too greedy with the discovery, if you get a very good tempo minion, pick it and use it's power to level and that will enable you to discover a win-condition at the right time without risking your hp. In spells meta, always hero power on 1 because you want to reach a 6 fast and spells also make your turns smoother.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Rafaam curve repeatedly freezing and heropowering to get a tier 6, use the buddy for a second tier 6 later",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG20_HERO_283",
			"name": "Galewing",
			"tips": [
				{
					"summary": "Depending on the lobby, think what you want to discover and in what sequence. This usually will help you understand if you want to pick gold or +2/+2 after the first discovery in order to either discover a 4, a 5 or a 6 with the 2nd discover.A cool curve is to go discover>2gold>discover and play basic leveling. That allows you to buy a minion on 8 gold when leveling from tavern 3 to 4 and smoothens out the curve for you to just rush 6 and snowball the lobby(Best in metagames where you want to rush6/discover6).",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Double a discover on tier 4 with your buddy. The possible paths to get there are 1/2/3, 2/1/3, or 2/3.",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_10",
			"name": "Trade Prince Gallywix",
			"tips": [
				{
					"summary": "Economy is king. Buy every minion that gives you more gold over 2 turns. Key is to be strong as much as you can early game because everyone is going to try to damage/kill you. Under-leveling can sometimes work but sometimes taking a bit of damage to be tavern 4 faster is worth it because you can stabilize easier there.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Gally is very reliant on the right minion types to be playable (elementals>pirates>dragons/murlocs)",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_15",
			"name": "George the Fallen",
			"tips": [
				{
					"summary": "Try to use a shield or two on some big minion early to put yourself in a good spot and then play normally and use shields when you have leftover gold or on powerful targets such as cleaves or high attack minions. Keep in mind to not fully relly on your hero power since people can play Blaster against you!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Don't",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_95",
			"name": "Greybough",
			"tips": [
				{
					"summary": "Play normally and abuse the tempo you get from a few minions that summon to level at least to tavern 5 and build something sticky and synergistic from there. Reborn is not always great because the reborned minion is going to be taunted(I don't recommend Mama comps on Greybough or at least don't reborn it)",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Deflect-o-Bot",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG20_HERO_242",
			"name": "Guff Runetotem",
			"tips": [
				{
					"summary": "I think the best way to play this hero now is via Toki curve(buying a minion on 1, leveling on 2, buying a 2 drop+hero power+ideally spell on 5 gold. Level+hero power on 6 gold and double buy+hero power on 7 gold). Can create some pretty powerful boards that then allow you to level and find a direction/win condition",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Pray that your first buddy gives direction",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG23_HERO_305",
			"name": "Heistbaron Togwaggle",
			"tips": [
				{
					"summary": "I like getting tokens and value generators early to give myself an easier way to cast the first hero power. Afterwards I try to snowball into going to 4 and going for a second hero power. From there, only hero power for value when the tavern shops are worth it, otherwise play normally and don’t get distracted by too many cards, find a gameplan and go for it!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Don't spend gold on your buddy; it's only good the turn after other players get tier 5 and 6 minions",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_67",
			"name": "Captain Hooktusk",
			"tips": [
				{
					"summary": "Best approach is to play normally and then when you get some high tier minions that have a good battlecry or one time effect, use it and then hero power it for some extra value. Can also be good to go for triples in some situation",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "The economy advantage from the buddy is best spent leveling faster",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_08",
			"name": "Illidan Stormrage",
			"tips": [
				{
					"summary": "Be careful not to have a minion you don’t want to die on first or last position! Try to play a build around cleave/divine shields for best usage of hero power.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Your heropower goes before minions' start of combat",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG26_HERO_102",
			"name": "Inge, the Iron Hymn",
			"tips": [
				{
					"summary": "Super good tempo hero, feel free to play a bit more aggressively with the leveling and triple-ing into high power minions since your hero power is at it’s best in the early-mid game!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Keep heropowering your buddy",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG22_HERO_200",
			"name": "Ini Stormcoil",
			"tips": [
				{
					"summary": "You can under-level slightly with this hero to make use of your hero power early game and then follow up by using your powerful board to level to 6 and go for end-game. Some strategies can just stay on 4 all the game though, it depends on the meta-game.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Don't",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_702",
			"name": "The Jailer",
			"tips": [
				{
					"summary": "Build around summoning minions but make sure to have a divine shield or cleave to put your buffs on once your hero power becomes big enough.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Deflect-o-Bot",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_71",
			"name": "Jandice Barov",
			"tips": [
				{
					"summary": "Play normally and when you get a good battlecry or minion that you’d be happy to keep switching and buying over and over. She’s generally a combo hero that is good when you have some broken combo available in the meta. Not great in every situation",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Jandice got banned from basically all the lobbies she's good in :(",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_37",
			"name": "Lord Jaraxxus",
			"tips": [
				{
					"summary": "You don't need to force demons, 1 big demon is enough so that you have a hero power target in most turns. Also, since the hero power is not THAT good, don't forcefully use it every turn, use it only when appropriate",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "A buddy that gives money and high armor is better than nothing",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BGDUO_HERO_104",
			"name": "Madam Goya",
			"tips": [
				{
					"summary": "You don't need to force demons, 1 big demon is enough so that you have a hero power target in most turns. Also, since the hero power is not THAT good, don't forcefully use it every turn, use it only when appropriate",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_60",
			"name": "Kael'thas Sunstrider",
			"tips": [
				{
					"summary": "Play basic curve or 3 on 3 most of the games, try to put stats on a divine shield or beefy minion(high health minions are best to be buffed)",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Don't",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_68",
			"name": "Skycap'n Kragg",
			"tips": [
				{
					"summary": "In the past most people were hero powering on 7 gold to level from 2 to 4. Now I think best is to keep it for when you level to tavern 5 and use it there for a very powerful turn.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Use Rylak, Young Murkeye, and Dreamer's Embrace on your buddy to repeatedly refresh your heropower",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG20_HERO_280",
			"name": "Kurtrus Ashfallen",
			"tips": [
				{
					"summary": "Play normally/safe early game and then go for a strategy where you want to buy and sell a lot of minions. Kurtrus will help either give you a strong duplicate or a triple if you get lucky. Best with elementals/pirates",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "With your buddy, buy spells before buying minions",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG23_HERO_304",
			"name": "Lady Vashj",
			"tips": [
				{
					"summary": "Play normally and let your hero power give you a slight boost. You have no obligation to play Naga since having a spellcraft on board doesn’t actually matter for your hero power. On tier 5 you can get a permanent divine shield for 1 gold, that’s really strong on any build!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Tier 1 buddy is a guaranteed triple, but it's bad direction",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_25",
			"name": "Lich Baz'hial",
			"tips": [
				{
					"summary": "Very good in demon lobbies due to Rewinder! Usually I like staying a bit more on tavern 1 to make a board and level to 2 on 5 gold while hero powering a minion. Leveling on 6 gold and playing the 2 cost hero curve works if you get great shops.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Demon synergy with the buddy is nice, but don't feel obligated to play for demons",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_22",
			"name": "The Lich King",
			"tips": [
				{
					"summary": "Really good to hero power leeroy late game. Until then try to get value hero powering a deathrattle or a minion with a good effect.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Requires undead in to be playable",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_62",
			"name": "Maiev Shadowsong",
			"tips": [
				{
					"summary": "Play Rafaam curve and try to hero power on 1 since that gives you a power spike earlier. Don't be too greedy with the triples, if you're losing a lot of fights it's okay to take a 3 or a 4 drop instead of going for 5 or 6's",
					"curves": ["rafaam"],
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Use Rylak/Young Murkeye for more golden minions; trigger the buddy twice to get the golden immediately",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_58",
			"name": "Malygos",
			"tips": [
				{
					"summary": "Try to make value out of nothing by hero powering economy units or a battlecry that you just played. Another thing you can do is hunt a specific minions if there’s a really crazy strong one in the meta.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "You can heropower minions and spells, but with your buddy focus on making high tier minions for direction",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_49",
			"name": "Millhouse Manastorm",
			"tips": [
				{
					"summary": "If you get a really bad shop and your board is strong enough for the turn, just level. It's a bigger risk to start rolling. This hero plays at it's best on 6 where you have most minions shown to you per roll but in most metas he can be super good on 4 and 5 as well!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Play buddy. Buy tier 5 minion. Play tier 5 minion. Buy tier 5 minion. Play tier 5 minion. Buy tier 5 minion...",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_17",
			"name": "Millificent Manastorm",
			"tips": [
				{
					"summary": "Buy every menace you can if you're forcing mechs but keep in mind you don't always need to force mechs, even on this hero. Sometimes the game leads you in a different direction.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Don't. Her nerfed buddy is worthless without Kangor's Apprentice",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_38",
			"name": "King Mukla",
			"tips": [
				{
					"summary": "Play normally and hold bananas for a decent minion(even buffing a good tavern 1 works in most cases). Once you have a good minion I’d play all the bananas on it and then play most my bannanas once I get them. Tempo is the best utilization of your hero power, don’t waste it and use it to level aggressively!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Before you get your buddy: play big bananas, hold small bananas",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG23_HERO_303",
			"name": "Murloc Holmes",
			"tips": [
				{
					"summary": "Try to guess correctly and remember what everyone bought on turn 1. Other than that use the coins to level agressively if needed or just buy a strong board. From there snowball intro a win-condition.Start every turn with hero powering since it both gives you information on your next opponent and also might change your turn depending on whether or not you get the coin.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Don't ever expect to get directional/strong minions from buddy, it's just more gold",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG20_HERO_301",
			"name": "Mutanus the Devourer",
			"tips": [
				{
					"summary": "Try to first build one big minion. From there you can build a board that synergizes with that one minion and can go crazy!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Make one minion as big as you can with heropower, and guarantee its stats land on your buddy",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG20_HERO_202",
			"name": "Master Nguyen",
			"tips": [
				{
					"summary": "Try to think of short term rather than going too long. If you pick short term hero power every turn you're more likely to win. Greedy picks are usually a bait.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Your buddy isn't good, but being a tier 1 it's a guaranteed triple on time",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_57",
			"name": "Nozdormu",
			"tips": [
				{
					"summary": "In the early game, use the hero power to get economy, followed by a powerful board and then use that to get to your win-condition. The hero power is more useful in the early part of the game so don't rely on it too much later.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Requires Demons in to be playable",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_93",
			"name": "N'Zoth",
			"tips": [
				{
					"summary": "In early mid game, just try to be strong because you can't always build around your hero power. Sometimes it's just going to be a 1 gold 2/2 and that's okay.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "The golden buddy sounds fun (goldening all your deathrattle minions) but isn't ever worth going for",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_74",
			"name": "Forest Warden Omu",
			"tips": [
				{
					"summary": "Level aggressively while playing efficiently. Spells made Omu a lot better because it’s easy to find a 1 or 2 cost spell to fill your early game curve. Stabilize on either tavern 3/4/5 depending on the meta and how aggressive your lobby is and then continue leveling until you hit a win condition.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Level fast, don't care too much about your buddy",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG22_HERO_305",
			"name": "Onyxia",
			"tips": [
				{
					"summary": "Try to build deathrattle/summon oriented, works best with something like Fel Stomper or with mechs that summon a lot of units.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Don't",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG23_HERO_201",
			"name": "Ozumat",
			"tips": [
				{
					"summary": "Play a bit around your hero power in the early part of the game but late-game you can even play 7 minions and forget about it.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Your buddy is not direction",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_18",
			"name": "Patches the Pirate",
			"tips": [
				{
					"summary": "Try to not buy non-pirate minions because it's going to make forcing pirates way harder. If you get no pirates at all it's fine to go for another build but don't pivot back into pirates afterwards.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Buddy can target the shop (and opponent's board if you Rylak)",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_34",
			"name": "Patchwerk",
			"tips": [
				{
					"summary": "Play a bit more greedy than usual(more leveling) to make use of your extra HP.You can think of this hero as having no hero power but 30 armor instead, that’s sometime good enough!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Level first, ask questions later",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG25_HERO_100",
			"name": "Professor Putricide",
			"tips": [
				{
					"summary": "The first hero power I like to use on tavern 3 or 4 and try to get a coin generator. If the game is going well, use the other 2 hero powers on 5 and 6, if the game goes badly use one or even both hero powers for tempo. Can also use hero power on turn 2 in some situations where you’d rather build early board presence and level afterwards.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Always heropower turn 2 looking for foul egg + risen rider to win all early fights",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_39",
			"name": "Pyramad",
			"tips": [
				{
					"summary": "An optimal number for this hero power is +5 health. At that amount or even higher if you want to be a bit greedy you should start hero powering every turn to make your board sticky.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Impulsive Trickster is your friend",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG22_HERO_007",
			"name": "Queen Azshara",
			"tips": [
				{
					"summary": "When you are getting close to activating your hero power, try to plan ahead and think what is the most optimal way of getting the attack that also allows you to discover one minion.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Force Deep Blues + Zesty Shakers, use Lava Lurkers to make stats permanent, not Shellementals",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_45",
			"name": "Arch-Villain Rafaam",
			"tips": [
				{
					"summary": "Hero power every turn in the begining of the game, your objective is to build a strong board and try to triple as much as possible. Level on 6 gold to tavern 2 and 7 gold to tavern 3. From there depending on the meta you either rush tavern 4/5 or stay a bit more on 3.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Try to level fast to find high tier direction; your buddy/heropower are too bad to take it slow",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_11",
			"name": "Ragnaros the Firelord",
			"tips": [
				{
					"summary": "Try to slightly under-level and finish your hero power, then buff divine shields or cleaves!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Don't",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_75",
			"name": "Rakanishu",
			"tips": [
				{
					"summary": "Ideally find a divine shield unit on tavern 1 and start buffing it while leveling. Both Rafaam curve and leveling on 4 and 6 gold work on this hero. ",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Living Azerite / Charging Czarina / Nalaa the Redeemer",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_12",
			"name": "The Rat King",
			"tips": [
				{
					"summary": "Try to power level while having a powerful board. Don't be greedy with the discoveries since leveling while keeping health is more important.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Tier 1 buddy is a guaranteed triple, free rolls are nice",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_41",
			"name": "Reno Jackson",
			"tips": [
				{
					"summary": "Play normally and use hero power for tempo on tavern 3 or 4 if you're taking a lot of damage or hold it for a 5 or 6 if you can afford to. You can get a 5 or 6 either from a triple or from an early patient scout. Don't focus too much around the hero power and use it whenever it gives you a good spot since you can change hero power on tavern 5 with the spell",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Don't spend a lot of gold on your buddy, it's almost exclusively a tempo tool",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG20_HERO_100",
			"name": "Rokara",
			"tips": [
				{
					"summary": "Best to build around divine shields or high health minions.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Look out for minion types with lots of tokens; you want other people to play Undead / Mechanized Gift Horse",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG20_HERO_102",
			"name": "Overlord Saurfang",
			"tips": [
				{
					"summary": "Try to build around divine shielded minions, also be aware that your hero power works on magnetic minions for buffing a mech multiple times!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Shop buffs are everything, temporary ones like Deep Blue are still good",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG21_HERO_010",
			"name": "Scabbs Cutterbutter",
			"tips": [
				{
					"summary": "Curve depends on what your opponents are doing. Either way, try to play kind of safe until you hit a win condition, then you can go crazy!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Early on, make an assessment of the other buddies in the lobby to see how much gold you can spend to buddy",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_23",
			"name": "Shudderwock",
			"tips": [
				{
					"summary": "Tempo is the name of the game on shudder, hero power either economy minions or minions that get stats or give you more future stats. Try to have an explosive turn early so that you don’t take too much damage, go a bit greedy and then rinse and repeat. Try to not be too greedy!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Your buddy sucks, but your heropower is good",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_90",
			"name": "Silas Darkmoon",
			"tips": [
				{
					"summary": "Prioritize ticket cards but don't go too crazy, don't buy EVERY single ticket card and if something good shows up in the shop, buy it even if it doesn't come with a ticket.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "GStay on tier 3 forever and play Deflect-o-Bots",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_27",
			"name": "Sindragosa",
			"tips": [
				{
					"summary": "Buy either the token/value generator or the lowest health minion. Then freeze the rest and play basic curve while buying strong minions. Use your strong board to carry you to taverns 5/6 and there look for a win-condition.",
					"curves": ["basic"],
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "You can target spells with your heropower",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG24_HERO_100",
			"name": "Sire Denathrius",
			"tips": [
				{
					"summary": "Try to plan to pick a quest that is good for the lobby you're playing and focus on finish it as fast as possible, without going too much out of your way until the last turn or so of the quest.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Don't spend gold on your buddy, focus on a completable quest",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG28_HERO_400",
			"name": "Snake Eyes",
			"tips": [
				{
					"summary": "The only time you should not hero power when it’s available is turn 2 if you roll 1 on 1. Just level and use it on 3. Otherwise, always hero power start of turn when you can and figure out the gameplan from there. If leveling is not efficient, then buy minions. If buying is not good, then level.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				}
			]
		},
		{
			"id": "BG21_HERO_030",
			"name": "Sneed",
			"tips": [
				{
					"summary": "Try hero powering as much as possible once you get to higher tavern tiers, especially once you first get to 3 or 4 and lategame on 6 drops!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Stack your heropower on one minion early; when you play your buddy it summons a board full of tier 5s",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG23_HERO_306",
			"name": "Sylvanas Windrunner",
			"tips": [
				{
					"summary": "You can either play Rafaam curve in a more aggro lobby or 3 on 3 and then start buffing those big minions!",
					"curves": ["rafaam", "3-on-3"],
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "In a Beast + Undead lobby: duplicate your buddy using Rylak and Graverobber (have no other undead)",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG28_HERO_800",
			"name": "Tae'thelan Bloodwatcher",
			"tips": [
				{
					"summary": "Best in Lobbies where you can force Lubber strategy. Get a bunch of them and a Soul Rewinder and try to go infinite by buying all the cheap spells and reroll. If this strategy is not available, try to not focus much on the hero power and play as close to normally as you can just getting a small bonus once in a while",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				}
			]
		},
		{
			"id": "BG20_HERO_282",
			"name": "Tamsin Roame",
			"tips": [
				{
					"summary": "Best with Elementals/Naga where your smallest minion is still big but also decent with demons or dragons.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Play Dragons to keep heropower stats permanently",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BGDUO_HERO_100",
			"name": "The Nameless One",
			"tips": [
				{
					"summary": "Try to do mostly your thing, your power comes from the fact that you were able to copy a good hero power and add some armor to the squad. Don’t complicate it.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				}
			]
		},
		{
			"id": "BG22_HERO_000",
			"name": "Tavish Stormpike",
			"tips": [
				{
					"summary": "Your hero power carries your early game. I like shooting high until lategame when I shoot low to hit leeroy/queen. ",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Don't",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG27_HERO_801",
			"name": "Thorim, Stormlord",
			"tips": [
				{
					"summary": "Try to think based on the available tribes if you can pick a minion that gives you direction and that you can force or a minion that is good overall(Varian for example). Afterwards you want to play normally but when you get close to your 7 drop you can do a crazy turn in order to get it one turn faster(by buying and selling minions you’d normally not purchase).",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Pray to whatever deities you believe in that you somehow survive long enough to do anything",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG25_HERO_103",
			"name": "Teron Gorefiend",
			"tips": [
				{
					"summary": "Best with undead and beasts, try to get Eternal Knight and grow it and then try to get your hands on Eternal Summoner and Titus Rivendare afterwards. Make sure you have enough board space to summon all the knights!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "The whole hero is Archlich Kel'Thuzad, do not touch without Undead",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_50",
			"name": "Tess Greymane",
			"tips": [
				{
					"summary": "Try to under-level, steal one good minion and build around it.Always keep an eye on what the lobby is playing but don’t pivot too much or you’ll end up being the jack of all trades, master of top8.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_94",
			"name": "Tickatus",
			"tips": [
				{
					"summary": "Plan for the prize turns and how you can use a good/bad outcome. Try to not rely too much on getting a good prize and have your own gameplay independent of the prizes, make them just be a bonus for something already great.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Use the first buddy turn 8+, and the second set of buddies turn 12+",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_28",
			"name": "Infinite Toki",
			"tips": [
				{
					"summary": "I recommend the 'Toki Curve' whenever possible. Play basic curve until 6 gold where you level to tavern 3 and hero power. Freeze the 4 drops if at least one is good and next turn you can buy 2 minions and hero power!",
					"curves": ["toki"],
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Brann + Young Murkeye your buddy",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG22_HERO_003",
			"name": "Vanndar Stormpike",
			"tips": [
				{
					"summary": "Good with deathrattles and summons but can work with something like poison or just any comp decently.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "You want Demons and Mechs",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG22_HERO_004",
			"name": "Varden Dawngrasp",
			"tips": [
				{
					"summary": "Plan your freezes to maximize chance to triple, don't be greedy with discoveries since if you're strong you can just level roll and set up an even better triple for the next turn. Always count how many minions you can freeze while still getting the hero power to work. For it to work, the amount of frozen minions needs to be at least 1 lower than the minions shown for a roll at that tavern.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Don't",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG26_HERO_104",
			"name": "Rock Master Voone",
			"tips": [
				{
					"summary": "For the first two activations of your hero power(on 5 and 8 gold), make sure you have first a very powerful 2 drop that you’d like to copy and after either a 5 drop if you managed to hit a triple or at least triple by utilizing the hero power.I always like to open the discover rather than copy the discovery spell because there are a lot of minions in the game that insta-win if you have two of them. You basically give yourself a chance at pocket aces!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Your buddy/heropower aren't strong enough for consistent lines. Buddy only once it's cheap",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG20_HERO_201",
			"name": "Vol'jin",
			"tips": [
				{
					"summary": "Play for tempo and try to go for either mechs or a big cleave mid/late-game. You don’t keep the stats permanently but it’s still a good boost to have!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Use Shellemental and Demon consume effects; heropower your biggest minion and a shop minion",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_14",
			"name": "Queen Wagtoggle",
			"tips": [
				{
					"summary": "Level as fast as you can to tavern 3/4 because getting a few high level units together with your hero power is going to give you a lot of power that then you can translate into time to find your direction/win condition.",
					"curves": ["rafaam"],
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Free tempo is pretty nice",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "BG20_HERO_101",
			"name": "Xyrella",
			"tips": [
				{
					"summary": "Economy curve into triples is the best way to play, don't be too greedy with the triples because it's going to cost you in health since the minions you hero power are 2/2's and they usually don't carry fights.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Buddy scaling is not relevant",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_35",
			"name": "Yogg-Saron, Hope's End",
			"tips": [
				{
					"summary": "Works with multiple curves depending on the meta but try to hero power as much as possible early and ignore it mid/late game. I pretty much only hero power late game if I have 2 left-over gold and I really don't want to roll.",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Play to win early fights, you need your buddy to be cheap",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_53",
			"name": "Ysera",
			"tips": [
				{
					"summary": "You have to force dragons on this hero, there are more aggressive ways of doing that like rushing taverns 3/4 or more conservative ways which build on tavern 1 before going 3/4. Depending on your rank and lobby you should figure out on the spot what works better for you!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Don't be afraid to sell your buddy if you get a good dragon board",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_92",
			"name": "Y'Shaarj",
			"tips": [
				{
					"summary": "King of leveling aggressively. Just be mindful of your health and of the good minions in that lobby. Once you snatch a good one you can build around it!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Heropower and buddy have great synergy with Diremuck Forager",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		},
		{
			"id": "TB_BaconShop_HERO_91",
			"name": "Zephrys, the Great",
			"tips": [
				{
					"summary": "Don't be too greedy with the first hero power, be mindful with the second hero power and greedy as hell with the third! Unless you are losing fights, in which case use all of them to stay alive as much as possible and save a bad game!",
					"author": "rdu",
					"language": "enUS",
					"patch": 198953,
					"date": "2024-05-17"
				},
				{
					"summary": "Triple into a tier 5 asap, copy the tier 5 with your buddy",
					"author": "curvesheet",
					"language": "enUS",
					"patch": 202360,
					"date": "2024-07-05"
				}
			]
		}
	],
	"curves": [
		{
			"id": "basic",
			"name": "Basic Curve",
			"notes": "Stronger with a token start, turn 4 shop RNG weakness. No heropower requirement.",
			"steps": [
				{
					"turn": 1,
					"actions": ["buy"]
				},
				{
					"turn": 2,
					"actions": [
						{
							"type": "level",
							"param": 2
						}
					]
				},
				{
					"turn": 3,
					"actions": ["sell", "buy", "buy"]
				},
				{
					"turn": 4,
					"actions": ["buy", "buy"]
				},
				{
					"turn": 5,
					"actions": [
						"buy",
						{
							"type": "level",
							"param": 3
						}
					]
				},
				{
					"turn": 6,
					"actions": ["buy", "buy", "roll", "roll"]
				},
				{
					"turn": 7,
					"actions": [
						{
							"type": "level",
							"param": 4
						},
						"roll",
						"buy"
					]
				}
			]
		},
		{
			"id": "fast-basic",
			"name": "Fast Basic Curve",
			"notes": "Stronger with a token start, turn 4 shop RNG weakness. No heropower requirement.",
			"steps": [
				{
					"turn": 1,
					"actions": ["buy"]
				},
				{
					"turn": 2,
					"actions": [
						{
							"type": "level",
							"param": 2
						}
					]
				},
				{
					"turn": 3,
					"actions": ["sell", "buy", "buy"]
				},
				{
					"turn": 4,
					"actions": ["buy", "buy"]
				},
				{
					"turn": 5,
					"actions": [
						"buy",
						{
							"type": "level",
							"param": 3
						}
					]
				},
				{
					"turn": 6,
					"actions": [
						{
							"type": "level",
							"param": 4
						},
						"roll"
					]
				}
			]
		},
		{
			"id": "jeef",
			"name": "Jeef Curve",
			"notes": "Uses tier 1 economy and strong pairs for a flexible start to the game with its variations.",
			"steps": [
				{
					"turn": 1,
					"actions": ["buy"]
				},
				{
					"turn": 2,
					"actions": ["buy", "roll"]
				},
				{
					"turn": 3,
					"actions": [
						{
							"type": "level",
							"param": 2
						},
						"buy",
						"sell"
					]
				},
				{
					"turn": 4,
					"actions": [
						{
							"type": "level",
							"param": 3
						}
					]
				},
				{
					"turn": 5,
					"actions": ["buy", "buy", "roll"]
				},
				{
					"turn": 6,
					"actions": [
						{
							"type": "level",
							"param": 4
						},
						"buy",
						"sell"
					]
				}
			]
		},
		{
			"id": "fast-jeef",
			"name": "Fast Jeef Curve",
			"notes": "Uses tier 1 economy and strong pairs for a flexible start to the game with its variations. Pushes levels quickly.",
			"steps": [
				{
					"turn": 1,
					"actions": ["buy"]
				},
				{
					"turn": 2,
					"actions": ["buy", "roll"]
				},
				{
					"turn": 3,
					"actions": [
						{
							"type": "level",
							"param": 2
						},
						"buy",
						"sell"
					]
				},
				{
					"turn": 4,
					"actions": [
						{
							"type": "level",
							"param": 3
						}
					]
				},
				{
					"turn": 5,
					"actions": [
						{
							"type": "level",
							"param": 4
						}
					]
				},
				{
					"turn": 6,
					"actions": ["buy", "buy", "roll", "roll"]
				}
			]
		},
		{
			"id": "slow-jeef",
			"name": "Slow Jeef Curve",
			"notes": "Uses tier 1 economy and strong pairs for a flexible start to the game with its variations. Stays on tier 2 to solidify the board.",
			"steps": [
				{
					"turn": 1,
					"actions": ["buy"]
				},
				{
					"turn": 2,
					"actions": ["buy", "roll"]
				},
				{
					"turn": 3,
					"actions": [
						{
							"type": "level",
							"param": 2
						},
						"buy",
						"sell"
					]
				},
				{
					"turn": 4,
					"actions": ["buy", "buy"]
				},
				{
					"turn": 5,
					"actions": [
						{
							"type": "level",
							"param": 3
						},
						"buy",
						"sell"
					]
				},
				{
					"turn": 6,
					"actions": [
						{
							"type": "level",
							"param": 3
						},
						"roll"
					]
				}
			]
		},
		{
			"id": "warrior",
			"name": "Warrior Curve",
			"notes": "A highly valueable line if tier 1 economy and forced triples are strong.",
			"steps": [
				{
					"turn": 1,
					"actions": ["buy"]
				},
				{
					"turn": 2,
					"actions": ["buy", "roll"]
				},
				{
					"turn": 3,
					"actions": ["buy", "sell", "buy"]
				},
				{
					"turn": 4,
					"actions": ["buy", "buy"]
				},
				{
					"turn": 5,
					"actions": [
						"sell",
						{
							"type": "level",
							"param": 2
						},
						{
							"type": "level",
							"param": 3
						}
					]
				},
				{
					"turn": 6,
					"actions": [
						{
							"type": "level",
							"param": 4
						},
						"roll"
					]
				}
			]
		},
		{
			"id": "extended-warrior",
			"name": "Extended Warrior Curve",
			"notes": "A highly valueable line if tier 1 economy and forced triples are strong. This variant is a fallback option in case a triple hasn't shown up yet playing regular warrior curve.",
			"steps": [
				{
					"turn": 1,
					"actions": ["buy"]
				},
				{
					"turn": 2,
					"actions": ["buy", "roll"]
				},
				{
					"turn": 3,
					"actions": ["buy", "sell", "buy"]
				},
				{
					"turn": 4,
					"actions": ["buy", "buy"]
				},
				{
					"turn": 5,
					"actions": ["buy", "buy", "roll"]
				},
				{
					"turn": 6,
					"actions": [
						{
							"type": "level",
							"param": 2
						},
						{
							"type": "level",
							"param": 3
						},
						"roll"
					]
				},
				{
					"turn": 7,
					"actions": [
						{
							"type": "level",
							"param": 4
						},
						"roll"
					]
				}
			]
		},
		{
			"id": "basic-yogg",
			"name": "Basic Yogg Curve",
			"notes": "Uses a 2-cost heropower to get to tier 3 faster.",
			"steps": [
				{
					"turn": 1,
					"actions": ["hero-power", "roll"]
				},
				{
					"turn": 2,
					"actions": [
						{
							"type": "level",
							"param": 2
						}
					]
				},
				{
					"turn": 3,
					"actions": ["hero-power", "buy"]
				},
				{
					"turn": 4,
					"actions": [
						{
							"type": "level",
							"param": 3
						},
						"sell",
						"hero-power"
					]
				},
				{
					"turn": 5,
					"actions": ["hero-power", "sell", "buy", "buy"]
				},
				{
					"turn": 6,
					"actions": [
						{
							"type": "level",
							"param": 4
						},
						"hero-power"
					]
				}
			]
		},
		{
			"id": "aggro-yogg",
			"name": "Aggro Yogg Curve",
			"notes": "Uses a 2-cost heropower to get good tier 1s on board before leveling to 3 faster",
			"steps": [
				{
					"turn": 1,
					"actions": ["hero-power", "roll"]
				},
				{
					"turn": 2,
					"actions": ["buy", "sell", "hero-power"]
				},
				{
					"turn": 3,
					"actions": [
						{
							"type": "level",
							"param": 2
						},
						"hero-power"
					]
				},
				{
					"turn": 4,
					"actions": ["hero-power", "roll", "buy"]
				},
				{
					"turn": 5,
					"actions": [
						{
							"type": "level",
							"param": 3
						},
						"hero-power"
					]
				},
				{
					"turn": 6,
					"actions": [
						{
							"type": "level",
							"param": 4
						},
						"hero-power"
					]
				}
			]
		},
		{
			"id": "rafaam",
			"name": "Rafaam Curve",
			"notes": "Clean leveling using 1-cost heropower, 2-cost heropower with economy, or tavern tippers",
			"steps": [
				{
					"turn": 1,
					"actions": ["buy"]
				},
				{
					"turn": 2,
					"actions": ["buy", "hero-power"]
				},
				{
					"turn": 3,
					"actions": ["buy", "roll", "hero-power"]
				},
				{
					"turn": 4,
					"actions": [
						{
							"type": "level",
							"param": 2
						},
						"buy",
						"hero-power"
					]
				},
				{
					"turn": 5,
					"actions": [
						{
							"type": "level",
							"param": 3
						},
						"hero-power"
					]
				},
				{
					"turn": 6,
					"actions": [
						{
							"type": "level",
							"param": 4
						},
						"hero-power"
					]
				}
			]
		},
		{
			"id": "slow-rafaam",
			"name": "Slow Rafaam Curve",
			"notes": "Clean leveling using 1-cost heropower, 2-cost heropower with economy, or tavern tippers. Cut off on tier 2 to get stronger",
			"steps": [
				{
					"turn": 1,
					"actions": ["buy"]
				},
				{
					"turn": 2,
					"actions": ["buy", "hero-power"]
				},
				{
					"turn": 3,
					"actions": ["buy", "roll", "hero-power"]
				},
				{
					"turn": 4,
					"actions": [
						{
							"type": "level",
							"param": 2
						},
						"buy",
						"hero-power"
					]
				},
				{
					"turn": 5,
					"actions": ["buy", "buy", "hero-power"]
				},
				{
					"turn": 6,
					"actions": [
						{
							"type": "level",
							"param": 3
						},
						"buy"
					]
				},
				{
					"turn": 7,
					"actions": [
						{
							"type": "level",
							"param": 4
						}
					]
				}
			]
		},
		{
			"id": "3-on-3",
			"name": "3 on 3 (Level on 8)",
			"notes": "Sacrifices early health to get very fast access to tier 3 minions, then pushes levels",
			"steps": [
				{
					"turn": 1,
					"actions": ["buy"]
				},
				{
					"turn": 2,
					"actions": [
						{
							"type": "level",
							"param": 2
						}
					]
				},
				{
					"turn": 3,
					"actions": [
						"sell",
						{
							"type": "level",
							"param": 3
						}
					]
				},
				{
					"turn": 4,
					"actions": ["buy", "buy"]
				},
				{
					"turn": 5,
					"actions": ["buy", "buy", "roll"]
				},
				{
					"turn": 6,
					"actions": [
						"buy",
						{
							"type": "level",
							"param": 4
						}
					]
				},
				{
					"turn": 7,
					"actions": ["buy", "buy", "roll", "roll", "roll"]
				}
			]
		},
		{
			"id": "3-on-3-bis",
			"name": "3 on 3 (Level on 9)",
			"notes": "Sacrifices early health to fill the board with tier 3 minions",
			"steps": [
				{
					"turn": 1,
					"actions": ["buy"]
				},
				{
					"turn": 2,
					"actions": [
						{
							"type": "level",
							"param": 2
						}
					]
				},
				{
					"turn": 3,
					"actions": [
						"sell",
						{
							"type": "level",
							"param": 3
						}
					]
				},
				{
					"turn": 4,
					"actions": ["buy", "buy"]
				},
				{
					"turn": 5,
					"actions": ["buy", "buy", "roll"]
				},
				{
					"turn": 6,
					"actions": ["buy", "buy", "roll", "roll"]
				},
				{
					"turn": 7,
					"actions": [
						{
							"type": "level",
							"param": 4
						},
						"roll",
						"roll",
						"buy"
					]
				}
			]
		},
		{
			"id": "4-on-4",
			"name": "4 on 4",
			"notes": "Sacrifices early health to get very fast access to tier 3 minions. A fallback option in case of a bad shop after 3 on 3; requires economy",
			"steps": [
				{
					"turn": 1,
					"actions": ["buy-token"]
				},
				{
					"turn": 2,
					"actions": [
						{
							"type": "level",
							"param": 2
						}
					]
				},
				{
					"turn": 3,
					"actions": [
						"sell",
						{
							"type": "level",
							"param": 3
						}
					]
				},
				{
					"turn": 4,
					"actions": [
						"sell",
						{
							"type": "level",
							"param": 4
						}
					]
				},
				{
					"turn": 5,
					"actions": ["buy", "buy", "roll"]
				},
				{
					"turn": 6,
					"actions": ["buy", "buy", "roll", "roll"]
				},
				{
					"turn": 7,
					"actions": ["buy", "buy", "roll", "roll", "roll"]
				}
			]
		},
		{
			"id": "toki",
			"name": "Toki Curve",
			"notes": "A way to use 1 cost heropowers that don't provide tempo",
			"steps": [
				{
					"turn": 1,
					"actions": ["buy-token"]
				},
				{
					"turn": 2,
					"actions": [
						{
							"type": "level",
							"param": 2
						}
					]
				},
				{
					"turn": 3,
					"actions": ["sell", "buy", "buy"]
				},
				{
					"turn": 4,
					"actions": [
						{
							"type": "level",
							"param": 3
						},
						"hero-power"
					]
				},
				{
					"turn": 5,
					"actions": ["hero-power", "buy", "buy"]
				},
				{
					"turn": 6,
					"actions": ["roll", "buy", "roll", "buy"]
				},
				{
					"turn": 7,
					"actions": [
						{
							"type": "level",
							"param": 7
						}
					]
				}
			]
		},
		{
			"id": "pocky",
			"name": "Pocky Curve",
			"notes": "A very niche use for 1 cost heropowers",
			"steps": [
				{
					"turn": 1,
					"actions": ["buy-token"]
				},
				{
					"turn": 2,
					"actions": [
						{
							"type": "level",
							"param": 2
						}
					]
				},
				{
					"turn": 3,
					"actions": ["buy", "hero-power", "roll"]
				},
				{
					"turn": 4,
					"actions": [
						{
							"type": "level",
							"param": 3
						},
						"sell",
						"hero-power"
					]
				},
				{
					"turn": 5,
					"actions": ["buy", "buy", "hero-power"]
				},
				{
					"turn": 6,
					"actions": [
						{
							"type": "level",
							"param": 4
						},
						"roll",
						"buy"
					]
				}
			]
		}
	],
	"authors": [
		{
			"id": "curvesheet",
			"name": "BG Curvesheet (Minder & Jkirek)",
			"link": "https://www.bgcurvesheet.com/",
			"highlights": "Former leaderboard #1 (Minder), Lobby Legends finalist (Jkirek)"
		},
		{
			"id": "rdu",
			"name": "RDU",
			"link": "https://www.twitch.tv/rdulive",
			"highlights": "Former leaderboard #1"
		}
	]
}
